app/controllers/welcomes_controller.rb

  def index
    @welcomes = Welcome.all
---
SELECT "welcomes".* FROM "welcomes"